# ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#
# American Project — игровой чат-бот для ВКонтакте, в котором вам необходимо играть за персонажа. Зарабатывайте деньги,
# становитесь богаче и покупайте себе имущество. Как только вы всего достигните, вы можете выбрать направление,
# куда пойти.
#
# Автор: Вова Батенков, 2022 год.
#
# ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

import asyncio, ast, states, json, time, datetime, random, traceback, loguru
from vkbottle.bot import Bot, Message, MessageEvent
from vkbottle import API, LoopWrapper, GroupEventType

# ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

bot = Bot('aed307a7c1248aea24454fb0e44d8c6c94c92255e759f701023ab1963501be1683acfd6fea6fe0596a28a')
api = API('25a06c2cbdd3d2788f0af4bc75c6c4b5ede3e807d16143eafe0e03ff286ac2089760a2d7da9ac8b1a9415')
lw = LoopWrapper()

# ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

# Стейты и их переходы
functions = states.STATES

# ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

# Обработка сообщений из бесед.
@bot.on.chat_message()
async def besidy(message: Message):
    await message.answer(
        message=f'❌ В данный момент нельзя запустить чат-бот в беседе!'
    )

# ——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————